In [2]:
stu={'name':['Kaaviya','krish','Alamu'],
     'school':['RGS','CPS','ITE'] }
stu

{'name': ['Kaaviya', 'krish', 'Alamu'], 'school': ['RGS', 'CPS', 'ITE']}

In [3]:
import pandas

In [6]:
df=pandas.DataFrame(stu)

In [7]:
df

      name school
0  Kaaviya    RGS
1    krish    CPS
2    Alamu    ITE

In [8]:
print(pandas.__version__)

1.2.4

In [9]:
df.loc[0]

name      Kaaviya
school        RGS
Name: 0, dtype: object

In [10]:
df.loc[1]

name      krish
school      CPS
Name: 1, dtype: object